Â ![png](data/books_erd.png)

In [5]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd

In [10]:
# Create connection string using credentials following this format
connection = "mysql+pymysql://root:root@localhost/books"

In [11]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [12]:
test_df = pd.read_csv('Data/data.csv')
test_df

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen
5,Gloria,Rodriguez,grodriguez@books.com,Pride and Prejudice,Jane Austen
6,Gloria,Rodriguez,grodriguez@books.com,Frankenstein,Mary Shelley

In [15]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [16]:
database_exists(connection)

True

In [17]:
users = pd.read_csv('data/users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [18]:
favorites = pd.read_csv('data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [19]:
books = pd.read_csv('data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [20]:
authors = pd.read_csv('data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [21]:
users.to_sql('users', engine, if_exists = 'replace')

In [22]:
books.to_sql('books', engine, if_exists = 'replace')

In [23]:
favorites.to_sql('favorites', engine, if_exists = 'replace')

In [24]:
authors.to_sql('authors', engine, if_exists = 'replace')

In [25]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [27]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));

"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1